Repository: sorivadomain/sorivaprojects
Catalog: locale/*/LC_MESSAGES/django.po
Languages: sw

source: Home
sw: Nyumbani

source: Year:
sw: Mwaka

source: Term:
sw: Muhula

source: Admin
sw: Admnini

source: Profile
sw: Wasifu

source: Select Language
sw: Chagua lugha

source: Sign out
sw: Ondoka

source: Pupils Details
sw: Taarifa za mwanafunzi

source: Student Details Chat Room
sw: Maoni ya taarifa za mwanafunzi

source: Finance
sw: Malipo

source: Pupil Payment Invoices
sw: Malipo ya ada

source: Parent Invoices Chatroom
sw: Maoni ya malipo

source: Results
sw: Matokeo

source: Pupil Results Form
sw: Fomu za matokeo

source: Results Chatroom
sw: Maoni ya matokeo
